Table of Contents
 Class MaterialParam
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Parameter which represts the record of the material in IDEA MPRL
[DataContract]
[Serializable]
public class MaterialParam : MprlRecord
Inheritance
object
MprlRecord
MaterialParam
Inherited Members
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page